; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13), and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;; The aim is to get all of the card home. The problems show quite a
;;; good variety of difficulty. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :typing)
  (:types card colnum cellnum num suit)
  (:predicates (on ?c1 - card ?c2 - card)
	       (incell ?c - card)
	       (clear ?c - card)
	       (cellspace ?n - cellnum)
	       (colspace ?n - colnum)
	       (home ?c - card)
	       (bottomcol ?c - card)
	       (canstack ?c1 - card ?c2 - card)
	       (hassuit ?c - card ?s - suit)
	       (value ?c - card ?v - num)
	       (successor ?n1 - num ?n0 - num)
	       (colsuccessor ?n1 - colnum ?n0 - colnum)
	       (cellsuccessor ?n1 - cellnum ?n0 - cellnum)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard - card)
	   :precondition (and (clear ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (on ?card ?oldcard))
	   :effect (and
		    (on ?card ?newcard)
		    (clear ?oldcard)
		    (not (on ?card ?oldcard))
		    (not (clear ?newcard))))

  (:action move-b
	   :parameters (?card ?newcard - card ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree
	   :parameters (?card ?oldcard - card ?cells ?ncells - cellnum)
	   :precondition (and
			  (clear ?card)
			  (on ?card ?oldcard)
			  (cellspace ?cells)
			  (cellsuccessor ?cells ?ncells))
	   :effect (and
		    (incell ?card)
		    (clear ?oldcard)
		    (cellspace ?ncells)
		    (not (on ?card ?oldcard))
		    (not (clear ?card))
		    (not (cellspace ?cells))))

  (:action sendtofree-b
	   :parameters (?card - card ?cells ?ncells - cellnum ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (cellspace ?cells)
			      (cellsuccessor ?cells ?ncells)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and
		    (incell ?card)
		    (colspace ?ncols)
		    (cellspace ?ncells)
		    (not (bottomcol ?card))
		    (not (clear ?card))
		    (not (colspace ?cols))
		    (not (cellspace ?cells))))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard - card ?cols ?ncols - colnum)
	 :precondition (and
			(clear ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
	 :effect (and
		  (bottomcol ?card)
		  (clear ?oldcard)
		  (colspace ?ncols)
		  (not (on ?card ?oldcard))
		  (not (colspace ?cols))))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num)
	 :precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
                      (not (home ?homecard))
		      (not (clear ?card))))

(:action sendtohome-b
	 :parameters (?card - card ?suitname - suit  ?vcard - num
			    ?homecard - card
			    ?vhomecard - num
			    ?cols ?ncols - colnum)
	 :precondition (and (clear ?card)
			    (bottomcol ?card)
			    (home ?homecard)
			    (hassuit ?card ?suitname)
			    (hassuit ?homecard ?suitname)
			    (value ?card ?vcard)
			    (value ?homecard ?vhomecard)
			    (successor ?vcard ?vhomecard)
			    (colspace ?cols)
			    (colsuccessor ?ncols ?cols))
	 :effect (and (home ?card)
		      (colspace ?ncols)
		      (not (home ?homecard))
		      (not (clear ?card))
		      (not (bottomcol ?card))
		      (not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num
			    ?cells ?ncells - cellnum)
    ;;Send a card home from a free cell.
	 :precondition (and
			(incell ?card)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(cellspace ?cells)
			(cellsuccessor ?ncells ?cells))
	 :effect (and
		  (home ?card)
		  (cellspace ?ncells)
		  (not (incell ?card))
		  (not (cellspace ?cells))
		  (not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard -  card ?cells ?ncells - cellnum)
	 :precondition (and  (incell ?card)
			     (clear ?newcard)
			     (canstack ?card ?newcard)
			     (cellspace ?cells)
			     (cellsuccessor ?ncells ?cells))
	 :effect (and (cellspace ?ncells)
		      (clear ?card)
		      (on ?card ?newcard)
		      (not (incell ?card))
		      (not (cellspace ?cells))
		      (not (clear ?newcard))))

(:action newcolfromfreecell
	 :parameters (?card - card ?cols ?ncols - colnum ?cells ?ncells - cellnum)
	 :precondition (and (incell ?card)
			    (colspace ?cols)
			    (cellspace ?cells)
			    (colsuccessor ?cols ?ncols)
			    (cellsuccessor ?ncells ?cells))
	 :effect (and (bottomcol ?card)
		      (clear ?card)
		      (colspace ?ncols)
		      (cellspace ?ncells)
		      (not (incell ?card))
		      (not (colspace ?cols))
		      (not (cellspace ?cells)))))

; problem
(define (problem freecell-f4-c9-s4-i9-012-112-212-312
)(:domain freecell)
(:objects 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12
          h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 h10 h11 h12
          s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 s11 s12
          d0 d1 d2 d3 d4 d5 d6 d7 d8 d9 d10 d11 d12
 - card
          celln0 celln1 celln2 celln3 celln4 
 - cellnum
          coln0 coln1 coln2 coln3 coln4 coln5 coln6 coln7 coln8 coln9 
 - colnum
          n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 
 - num
           c h s d
 - suit
)
(:init
(value c0 n0)
(value c1 n1)
(value c2 n2)
(value c3 n3)
(value c4 n4)
(value c5 n5)
(value c6 n6)
(value c7 n7)
(value c8 n8)
(value c9 n9)
(value c10 n10)
(value c11 n11)
(value c12 n12)
(value h0 n0)
(value h1 n1)
(value h2 n2)
(value h3 n3)
(value h4 n4)
(value h5 n5)
(value h6 n6)
(value h7 n7)
(value h8 n8)
(value h9 n9)
(value h10 n10)
(value h11 n11)
(value h12 n12)
(value s0 n0)
(value s1 n1)
(value s2 n2)
(value s3 n3)
(value s4 n4)
(value s5 n5)
(value s6 n6)
(value s7 n7)
(value s8 n8)
(value s9 n9)
(value s10 n10)
(value s11 n11)
(value s12 n12)
(value d0 n0)
(value d1 n1)
(value d2 n2)
(value d3 n3)
(value d4 n4)
(value d5 n5)
(value d6 n6)
(value d7 n7)
(value d8 n8)
(value d9 n9)
(value d10 n10)
(value d11 n11)
(value d12 n12)
(cellsuccessor celln1 celln0)
(cellsuccessor celln2 celln1)
(cellsuccessor celln3 celln2)
(cellsuccessor celln4 celln3)
(colsuccessor coln1 coln0)
(colsuccessor coln2 coln1)
(colsuccessor coln3 coln2)
(colsuccessor coln4 coln3)
(colsuccessor coln5 coln4)
(colsuccessor coln6 coln5)
(colsuccessor coln7 coln6)
(colsuccessor coln8 coln7)
(colsuccessor coln9 coln8)
(successor n1 n0)
(successor n2 n1)
(successor n3 n2)
(successor n4 n3)
(successor n5 n4)
(successor n6 n5)
(successor n7 n6)
(successor n8 n7)
(successor n9 n8)
(successor n10 n9)
(successor n11 n10)
(successor n12 n11)
(hassuit c0 c)
(hassuit c1 c)
(hassuit c2 c)
(hassuit c3 c)
(hassuit c4 c)
(hassuit c5 c)
(hassuit c6 c)
(hassuit c7 c)
(hassuit c8 c)
(hassuit c9 c)
(hassuit c10 c)
(hassuit c11 c)
(hassuit c12 c)
(hassuit h0 h)
(hassuit h1 h)
(hassuit h2 h)
(hassuit h3 h)
(hassuit h4 h)
(hassuit h5 h)
(hassuit h6 h)
(hassuit h7 h)
(hassuit h8 h)
(hassuit h9 h)
(hassuit h10 h)
(hassuit h11 h)
(hassuit h12 h)
(hassuit s0 s)
(hassuit s1 s)
(hassuit s2 s)
(hassuit s3 s)
(hassuit s4 s)
(hassuit s5 s)
(hassuit s6 s)
(hassuit s7 s)
(hassuit s8 s)
(hassuit s9 s)
(hassuit s10 s)
(hassuit s11 s)
(hassuit s12 s)
(hassuit d0 d)
(hassuit d1 d)
(hassuit d2 d)
(hassuit d3 d)
(hassuit d4 d)
(hassuit d5 d)
(hassuit d6 d)
(hassuit d7 d)
(hassuit d8 d)
(hassuit d9 d)
(hassuit d10 d)
(hassuit d11 d)
(hassuit d12 d)
(canstack c2 h3)
(canstack c2 d3)
(canstack c3 h4)
(canstack c3 d4)
(canstack c4 h5)
(canstack c4 d5)
(canstack c5 h6)
(canstack c5 d6)
(canstack c6 h7)
(canstack c6 d7)
(canstack c7 h8)
(canstack c7 d8)
(canstack c8 h9)
(canstack c8 d9)
(canstack c9 h10)
(canstack c9 d10)
(canstack c10 h11)
(canstack c10 d11)
(canstack c11 h12)
(canstack c11 d12)
(canstack h2 c3)
(canstack h2 s3)
(canstack h3 c4)
(canstack h3 s4)
(canstack h4 c5)
(canstack h4 s5)
(canstack h5 c6)
(canstack h5 s6)
(canstack h6 c7)
(canstack h6 s7)
(canstack h7 c8)
(canstack h7 s8)
(canstack h8 c9)
(canstack h8 s9)
(canstack h9 c10)
(canstack h9 s10)
(canstack h10 c11)
(canstack h10 s11)
(canstack h11 c12)
(canstack h11 s12)
(canstack s2 h3)
(canstack s2 d3)
(canstack s3 h4)
(canstack s3 d4)
(canstack s4 h5)
(canstack s4 d5)
(canstack s5 h6)
(canstack s5 d6)
(canstack s6 h7)
(canstack s6 d7)
(canstack s7 h8)
(canstack s7 d8)
(canstack s8 h9)
(canstack s8 d9)
(canstack s9 h10)
(canstack s9 d10)
(canstack s10 h11)
(canstack s10 d11)
(canstack s11 h12)
(canstack s11 d12)
(canstack d2 c3)
(canstack d2 s3)
(canstack d3 c4)
(canstack d3 s4)
(canstack d4 c5)
(canstack d4 s5)
(canstack d5 c6)
(canstack d5 s6)
(canstack d6 c7)
(canstack d6 s7)
(canstack d7 c8)
(canstack d7 s8)
(canstack d8 c9)
(canstack d8 s9)
(canstack d9 c10)
(canstack d9 s10)
(canstack d10 c11)
(canstack d10 s11)
(canstack d11 c12)
(canstack d11 s12)
(home c0)
(home h0)
(home s0)
(home d0)
(cellspace celln4)
(colspace coln0)

(bottomcol s4)
(on s1 s4)
(on s9 s1)
(on d7 s9)
(on d1 d7)
(on h9 d1)
(clear h9)

(bottomcol h1)
(on d6 h1)
(on c5 d6)
(on c3 c5)
(on c6 c3)
(on h8 c6)
(on s3 h8)
(on d11 s3)
(clear d11)

(bottomcol c4)
(on c9 c4)
(clear c9)

(bottomcol s12)
(on s11 s12)
(on c7 s11)
(on d2 c7)
(on s10 d2)
(on h2 s10)
(on h5 h2)
(on d4 h5)
(on h10 d4)
(clear h10)

(bottomcol s7)
(on c12 s7)
(on d10 c12)
(on h6 d10)
(on c8 h6)
(on h4 c8)
(on s8 h4)
(on h12 s8)
(clear h12)

(bottomcol h7)
(on d8 h7)
(on d12 d8)
(clear d12)

(bottomcol c2)
(on c1 c2)
(on d9 c1)
(clear d9)

(bottomcol h3)
(on d3 h3)
(on c11 d3)
(on c10 c11)
(on h11 c10)
(on s2 h11)
(on d5 s2)
(on s6 d5)
(clear s6)

(bottomcol s5)
(clear s5)
)
(:goal
(and
(home c12)
(home h12)
(home s12)
(home d12)
)
)
)

; plan
1. (sendtofree d9 c1 celln4 celln3)
   deleted: (on d9 c1) (clear d9) (cellspace celln4)
   added: (incell d9) (clear c1) (cellspace celln3)
   goals met: 0 of 4
2. (sendtohome c1 c2 c n1 c0 n0)
   deleted: (on c1 c2) (home c0) (clear c1)
   added: (home c1) (clear c2)
   goals met: 0 of 4
3. (sendtohome-b c2 c n2 c1 n1 coln0 coln1)
   deleted: (home c1) (clear c2) (bottomcol c2) (colspace coln0)
   added: (home c2) (colspace coln1)
   goals met: 0 of 4
4. (sendtofree h9 d1 celln3 celln2)
   deleted: (on h9 d1) (clear h9) (cellspace celln3)
   added: (incell h9) (clear d1) (cellspace celln2)
   goals met: 0 of 4
5. (sendtohome d1 d7 d n1 d0 n0)
   deleted: (on d1 d7) (home d0) (clear d1)
   added: (home d1) (clear d7)
   goals met: 0 of 4
6. (sendtofree d11 s3 celln2 celln1)
   deleted: (on d11 s3) (clear d11) (cellspace celln2)
   added: (incell d11) (clear s3) (cellspace celln1)
   goals met: 0 of 4
7. (sendtofree s3 h8 celln1 celln0)
   deleted: (on s3 h8) (clear s3) (cellspace celln1)
   added: (incell s3) (clear h8) (cellspace celln0)
   goals met: 0 of 4
8. (sendtonewcol d7 s9 coln1 coln0)
   deleted: (on d7 s9) (colspace coln1)
   added: (bottomcol d7) (clear s9) (colspace coln0)
   goals met: 0 of 4
9. (move s9 s1 h10)
   deleted: (on s9 s1) (clear h10)
   added: (on s9 h10) (clear s1)
   goals met: 0 of 4
10. (sendtohome s1 s4 s n1 s0 n0)
   deleted: (on s1 s4) (home s0) (clear s1)
   added: (home s1) (clear s4)
   goals met: 0 of 4
11. (move s6 d5 d7)
   deleted: (on s6 d5) (clear d7)
   added: (on s6 d7) (clear d5)
   goals met: 0 of 4
12. (move d5 s2 s6)
   deleted: (on d5 s2) (clear s6)
   added: (on d5 s6) (clear s2)
   goals met: 0 of 4
13. (sendtohome s2 h11 s n2 s1 n1)
   deleted: (on s2 h11) (home s1) (clear s2)
   added: (home s2) (clear h11)
   goals met: 0 of 4
14. (homefromfreecell s3 s n3 s2 n2 celln0 celln1)
   deleted: (incell s3) (cellspace celln0) (home s2)
   added: (home s3) (cellspace celln1)
   goals met: 0 of 4
15. (sendtohome-b s4 s n4 s3 n3 coln0 coln1)
   deleted: (home s3) (clear s4) (bottomcol s4) (colspace coln0)
   added: (home s4) (colspace coln1)
   goals met: 0 of 4
16. (sendtohome-b s5 s n5 s4 n4 coln1 coln2)
   deleted: (home s4) (clear s5) (bottomcol s5) (colspace coln1)
   added: (home s5) (colspace coln2)
   goals met: 0 of 4
17. (sendtofree c9 c4 celln1 celln0)
   deleted: (on c9 c4) (clear c9) (cellspace celln1)
   added: (incell c9) (clear c4) (cellspace celln0)
   goals met: 0 of 4
18. (move h8 c6 s9)
   deleted: (on h8 c6) (clear s9)
   added: (on h8 s9) (clear c6)
   goals met: 0 of 4
19. (sendtonewcol c6 c3 coln2 coln1)
   deleted: (on c6 c3) (colspace coln2)
   added: (bottomcol c6) (clear c3) (colspace coln1)
   goals met: 0 of 4
20. (sendtohome c3 c5 c n3 c2 n2)
   deleted: (on c3 c5) (home c2) (clear c3)
   added: (home c3) (clear c5)
   goals met: 0 of 4
21. (sendtohome-b c4 c n4 c3 n3 coln1 coln2)
   deleted: (home c3) (clear c4) (bottomcol c4) (colspace coln1)
   added: (home c4) (colspace coln2)
   goals met: 0 of 4
22. (sendtohome c5 d6 c n5 c4 n4)
   deleted: (on c5 d6) (home c4) (clear c5)
   added: (home c5) (clear d6)
   goals met: 0 of 4
23. (sendtonewcol d6 h1 coln2 coln1)
   deleted: (on d6 h1) (colspace coln2)
   added: (bottomcol d6) (clear h1) (colspace coln1)
   goals met: 0 of 4
24. (sendtohome-b h1 h n1 h0 n0 coln1 coln2)
   deleted: (home h0) (clear h1) (bottomcol h1) (colspace coln1)
   added: (home h1) (colspace coln2)
   goals met: 0 of 4
25. (sendtohome-b c6 c n6 c5 n5 coln2 coln3)
   deleted: (home c5) (clear c6) (bottomcol c6) (colspace coln2)
   added: (home c6) (colspace coln3)
   goals met: 0 of 4
26. (sendtonewcol h8 s9 coln3 coln2)
   deleted: (on h8 s9) (colspace coln3)
   added: (bottomcol h8) (clear s9) (colspace coln2)
   goals met: 0 of 4
27. (sendtonewcol h12 s8 coln2 coln1)
   deleted: (on h12 s8) (colspace coln2)
   added: (bottomcol h12) (clear s8) (colspace coln1)
   goals met: 0 of 4
28. (sendtonewcol d5 s6 coln1 coln0)
   deleted: (on d5 s6) (colspace coln1)
   added: (bottomcol d5) (clear s6) (colspace coln0)
   goals met: 0 of 4
29. (sendtohome s6 d7 s n6 s5 n5)
   deleted: (on s6 d7) (home s5) (clear s6)
   added: (home s6) (clear d7)
   goals met: 0 of 4
30. (move-b h8 s9 coln0 coln1)
   deleted: (bottomcol h8) (clear s9) (colspace coln0)
   added: (on h8 s9) (colspace coln1)
   goals met: 0 of 4
31. (sendtonewcol h11 c10 coln1 coln0)
   deleted: (on h11 c10) (colspace coln1)
   added: (bottomcol h11) (clear c10) (colspace coln0)
   goals met: 0 of 4
32. (move-b d7 s8 coln0 coln1)
   deleted: (bottomcol d7) (clear s8) (colspace coln0)
   added: (on d7 s8) (colspace coln1)
   goals met: 0 of 4
33. (move c10 c11 h11)
   deleted: (on c10 c11) (clear h11)
   added: (on c10 h11) (clear c11)
   goals met: 0 of 4
34. (move c11 d3 d12)
   deleted: (on c11 d3) (clear d12)
   added: (on c11 d12) (clear d3)
   goals met: 0 of 4
35. (move c11 d12 h12)
   deleted: (on c11 d12) (clear h12)
   added: (on c11 h12) (clear d12)
   goals met: 0 of 4
36. (sendtonewcol d7 s8 coln1 coln0)
   deleted: (on d7 s8) (colspace coln1)
   added: (bottomcol d7) (clear s8) (colspace coln0)
   goals met: 0 of 4
37. (colfromfreecell d9 c10 celln0 celln1)
   deleted: (incell d9) (cellspace celln0) (clear c10)
   added: (cellspace celln1) (clear d9) (on d9 c10)
   goals met: 0 of 4
38. (move s8 h4 d9)
   deleted: (on s8 h4) (clear d9)
   added: (on s8 d9) (clear h4)
   goals met: 0 of 4
39. (sendtofree h8 s9 celln1 celln0)
   deleted: (on h8 s9) (clear h8) (cellspace celln1)
   added: (incell h8) (clear s9) (cellspace celln0)
   goals met: 0 of 4
40. (move-b d7 s8 coln0 coln1)
   deleted: (bottomcol d7) (clear s8) (colspace coln0)
   added: (on d7 s8) (colspace coln1)
   goals met: 0 of 4
41. (sendtonewcol s9 h10 coln1 coln0)
   deleted: (on s9 h10) (colspace coln1)
   added: (bottomcol s9) (clear h10) (colspace coln0)
   goals met: 0 of 4
42. (move h10 d4 c11)
   deleted: (on h10 d4) (clear c11)
   added: (on h10 c11) (clear d4)
   goals met: 0 of 4
43. (colfromfreecell c9 h10 celln0 celln1)
   deleted: (incell c9) (cellspace celln0) (clear h10)
   added: (cellspace celln1) (clear c9) (on c9 h10)
   goals met: 0 of 4
44. (sendtofree d4 h5 celln1 celln0)
   deleted: (on d4 h5) (clear d4) (cellspace celln1)
   added: (incell d4) (clear h5) (cellspace celln0)
   goals met: 0 of 4
45. (colfromfreecell h8 c9 celln0 celln1)
   deleted: (incell h8) (cellspace celln0) (clear c9)
   added: (cellspace celln1) (clear h8) (on h8 c9)
   goals met: 0 of 4
46. (sendtofree h5 h2 celln1 celln0)
   deleted: (on h5 h2) (clear h5) (cellspace celln1)
   added: (incell h5) (clear h2) (cellspace celln0)
   goals met: 0 of 4
47. (sendtohome h2 s10 h n2 h1 n1)
   deleted: (on h2 s10) (home h1) (clear h2)
   added: (home h2) (clear s10)
   goals met: 0 of 4
48. (colfromfreecell h9 s10 celln0 celln1)
   deleted: (incell h9) (cellspace celln0) (clear s10)
   added: (cellspace celln1) (clear h9) (on h9 s10)
   goals met: 0 of 4
49. (sendtofree d3 h3 celln1 celln0)
   deleted: (on d3 h3) (clear d3) (cellspace celln1)
   added: (incell d3) (clear h3) (cellspace celln0)
   goals met: 0 of 4
50. (sendtohome-b h3 h n3 h2 n2 coln0 coln1)
   deleted: (home h2) (clear h3) (bottomcol h3) (colspace coln0)
   added: (home h3) (colspace coln1)
   goals met: 0 of 4
51. (sendtohome h4 c8 h n4 h3 n3)
   deleted: (on h4 c8) (home h3) (clear h4)
   added: (home h4) (clear c8)
   goals met: 0 of 4
52. (homefromfreecell h5 h n5 h4 n4 celln0 celln1)
   deleted: (incell h5) (cellspace celln0) (home h4)
   added: (home h5) (cellspace celln1)
   goals met: 0 of 4
53. (move c8 h6 h9)
   deleted: (on c8 h6) (clear h9)
   added: (on c8 h9) (clear h6)
   goals met: 0 of 4
54. (sendtohome h6 d10 h n6 h5 n5)
   deleted: (on h6 d10) (home h5) (clear h6)
   added: (home h6) (clear d10)
   goals met: 0 of 4
55. (sendtofree d12 d8 celln1 celln0)
   deleted: (on d12 d8) (clear d12) (cellspace celln1)
   added: (incell d12) (clear d8) (cellspace celln0)
   goals met: 0 of 4
56. (move d8 h7 s9)
   deleted: (on d8 h7) (clear s9)
   added: (on d8 s9) (clear h7)
   goals met: 0 of 4
57. (sendtohome-b h7 h n7 h6 n6 coln1 coln2)
   deleted: (home h6) (clear h7) (bottomcol h7) (colspace coln1)
   added: (home h7) (colspace coln2)
   goals met: 0 of 4
58. (sendtohome h8 c9 h n8 h7 n7)
   deleted: (on h8 c9) (home h7) (clear h8)
   added: (home h8) (clear c9)
   goals met: 0 of 4
59. (sendtonewcol d10 c12 coln2 coln1)
   deleted: (on d10 c12) (colspace coln2)
   added: (bottomcol d10) (clear c12) (colspace coln1)
   goals met: 0 of 4
60. (sendtonewcol c12 s7 coln1 coln0)
   deleted: (on c12 s7) (colspace coln1)
   added: (bottomcol c12) (clear s7) (colspace coln0)
   goals met: 0 of 4
61. (sendtohome-b s7 s n7 s6 n6 coln0 coln1)
   deleted: (home s6) (clear s7) (bottomcol s7) (colspace coln0)
   added: (home s7) (colspace coln1)
   goals met: 0 of 4
62. (move d7 s8 c8)
   deleted: (on d7 s8) (clear c8)
   added: (on d7 c8) (clear s8)
   goals met: 0 of 4
63. (sendtohome s8 d9 s n8 s7 n7)
   deleted: (on s8 d9) (home s7) (clear s8)
   added: (home s8) (clear d9)
   goals met: 0 of 4
64. (move d8 s9 c9)
   deleted: (on d8 s9) (clear c9)
   added: (on d8 c9) (clear s9)
   goals met: 0 of 4
65. (sendtohome-b s9 s n9 s8 n8 coln1 coln2)
   deleted: (home s8) (clear s9) (bottomcol s9) (colspace coln1)
   added: (home s9) (colspace coln2)
   goals met: 0 of 4
66. (sendtonewcol d7 c8 coln2 coln1)
   deleted: (on d7 c8) (colspace coln2)
   added: (bottomcol d7) (clear c8) (colspace coln1)
   goals met: 0 of 4
67. (move c8 h9 d9)
   deleted: (on c8 h9) (clear d9)
   added: (on c8 d9) (clear h9)
   goals met: 0 of 4
68. (sendtohome h9 s10 h n9 h8 n8)
   deleted: (on h9 s10) (home h8) (clear h9)
   added: (home h9) (clear s10)
   goals met: 0 of 4
69. (sendtohome s10 d2 s n10 s9 n9)
   deleted: (on s10 d2) (home s9) (clear s10)
   added: (home s10) (clear d2)
   goals met: 0 of 4
70. (sendtohome d2 c7 d n2 d1 n1)
   deleted: (on d2 c7) (home d1) (clear d2)
   added: (home d2) (clear c7)
   goals met: 0 of 4
71. (homefromfreecell d3 d n3 d2 n2 celln0 celln1)
   deleted: (incell d3) (cellspace celln0) (home d2)
   added: (home d3) (cellspace celln1)
   goals met: 0 of 4
72. (homefromfreecell d4 d n4 d3 n3 celln1 celln2)
   deleted: (incell d4) (cellspace celln1) (home d3)
   added: (home d4) (cellspace celln2)
   goals met: 0 of 4
73. (sendtohome-b d5 d n5 d4 n4 coln1 coln2)
   deleted: (home d4) (clear d5) (bottomcol d5) (colspace coln1)
   added: (home d5) (colspace coln2)
   goals met: 0 of 4
74. (sendtohome-b d6 d n6 d5 n5 coln2 coln3)
   deleted: (home d5) (clear d6) (bottomcol d6) (colspace coln2)
   added: (home d6) (colspace coln3)
   goals met: 0 of 4
75. (sendtohome-b d7 d n7 d6 n6 coln3 coln4)
   deleted: (home d6) (clear d7) (bottomcol d7) (colspace coln3)
   added: (home d7) (colspace coln4)
   goals met: 0 of 4
76. (sendtohome c7 s11 c n7 c6 n6)
   deleted: (on c7 s11) (home c6) (clear c7)
   added: (home c7) (clear s11)
   goals met: 0 of 4
77. (sendtohome d8 c9 d n8 d7 n7)
   deleted: (on d8 c9) (home d7) (clear d8)
   added: (home d8) (clear c9)
   goals met: 0 of 4
78. (sendtohome c8 d9 c n8 c7 n7)
   deleted: (on c8 d9) (home c7) (clear c8)
   added: (home c8) (clear d9)
   goals met: 0 of 4
79. (sendtohome c9 h10 c n9 c8 n8)
   deleted: (on c9 h10) (home c8) (clear c9)
   added: (home c9) (clear h10)
   goals met: 0 of 4
80. (sendtohome h10 c11 h n10 h9 n9)
   deleted: (on h10 c11) (home h9) (clear h10)
   added: (home h10) (clear c11)
   goals met: 0 of 4
81. (sendtohome d9 c10 d n9 d8 n8)
   deleted: (on d9 c10) (home d8) (clear d9)
   added: (home d9) (clear c10)
   goals met: 0 of 4
82. (sendtohome-b d10 d n10 d9 n9 coln4 coln5)
   deleted: (home d9) (clear d10) (bottomcol d10) (colspace coln4)
   added: (home d10) (colspace coln5)
   goals met: 0 of 4
83. (sendtohome c10 h11 c n10 c9 n9)
   deleted: (on c10 h11) (home c9) (clear c10)
   added: (home c10) (clear h11)
   goals met: 0 of 4
84. (sendtohome-b h11 h n11 h10 n10 coln5 coln6)
   deleted: (home h10) (clear h11) (bottomcol h11) (colspace coln5)
   added: (home h11) (colspace coln6)
   goals met: 0 of 4
85. (sendtohome s11 s12 s n11 s10 n10)
   deleted: (on s11 s12) (home s10) (clear s11)
   added: (home s11) (clear s12)
   goals met: 0 of 4
86. (sendtohome-b s12 s n12 s11 n11 coln6 coln7)
   deleted: (home s11) (clear s12) (bottomcol s12) (colspace coln6)
   added: (home s12) (colspace coln7)
   goals met: 1 of 4
87. (homefromfreecell d11 d n11 d10 n10 celln2 celln3)
   deleted: (incell d11) (cellspace celln2) (home d10)
   added: (home d11) (cellspace celln3)
   goals met: 1 of 4
88. (homefromfreecell d12 d n12 d11 n11 celln3 celln4)
   deleted: (incell d12) (cellspace celln3) (home d11)
   added: (home d12) (cellspace celln4)
   goals met: 2 of 4
89. (sendtohome c11 h12 c n11 c10 n10)
   deleted: (on c11 h12) (home c10) (clear c11)
   added: (home c11) (clear h12)
   goals met: 2 of 4
90. (sendtohome-b c12 c n12 c11 n11 coln7 coln8)
   deleted: (home c11) (clear c12) (bottomcol c12) (colspace coln7)
   added: (home c12) (colspace coln8)
   goals met: 3 of 4
91. (sendtohome-b h12 h n12 h11 n11 coln8 coln9)
   deleted: (home h11) (clear h12) (bottomcol h12) (colspace coln8)
   added: (home h12) (colspace coln9)
   goals met: 4 of 4
